package com.cassandra.data.CreateData;

/**
 * 静态基本信息的模拟数据及规格数据
 */

import java.sql.Timestamp;

public interface TestData {
	final static String[] project_name = {"Apple","Orange","Banana","Peach","Grape","Lemon","Pear","Mango","Star fruit","coconut"};
	final static String[] project_address = {"510000","330000","710000","430000","410000","310000","210000","050000","450000","610000"};
	final static String[] province = {"广东省","江西省","陕西省","湖北省","湖南省","浙江省","江苏省","河北省","河南省","四川省"};
	final static String[] city = {"one","two","three","four","five","six","seven","eight","nine","ten"};
	final static String[] district = {"A","B","C","D","E","F","G","H","I","J"};
	final static String[] building_name = {"一栋","二栋","三栋","四栋","五栋","六栋","七栋","八栋","九栋","十栋"};
	final static String[] floor_name = {"一楼","二楼","三楼","四楼","五楼","六楼","七楼","八楼","九楼","十楼","十一楼"};
	final static String[] device_state = {"正常","异常","离线"};
	
	final static String[] param_names = {"高度","温度","压力","压力","气体浓度","气体浓度","气体浓度","气体浓度","气体浓度",
			"时间","电压","电流","流量","风量","风速","剩余电流","烟参量"};
	final static String[] param_unit = {"0.01m","0.1℃","0.1MPa","0.1kPa","0.1%LEL","0.1*10^-6体积比","0.1%体积比","1000*10^-6体积比","1mg/m^3",
			"1s","0.1V","0.1A","0.1L/s","0.1m^3/min","0.1m/s","1mA","自定义"};
	final static int[] event_code = {1,2,3,4,5,6,7,8,20,21,22,23,24,25,26,27,28,29,30,40,43, 44, 45, 46, 89, 90, 109, 110,
						41,42,47,48,49,50,51,52,53,54,55,56,70,71,72,73,80,81,82,83,84,85,86,87,88,
						100,101,102,103,104,105,106,107,108,120,121,123,124,127,128,129};
	final static String[] event_level = {"正常", "一般", "紧急"};
//	final static int event_code_len = event_code.length;
    
	final static int[] device_code = {1,2,3,10,11,12,13,14,15,16,20,21,22,23,24,25,30,31,32,33,34,35,40,41,42,43,50,
			51,52,53,61,62,63,64,71,72,73,74,75,76,81,82,83,84,85,86,100,101,102,103,110,
			111,112,113,114,120,121,122,123,124,130,131,132,133,134,135,140,141,142,143,
			150,151,152,153,154,155,156,157,158,159,160,161,162,163,180,181,182,183,184,
			185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209};
//	final static int device_code_len = device_code.length;
	
	final static String[] device_names = {"火灾报警控制器/火灾报警控制器（联动型）","消防联动控制器","消防控制室图形显示装置",
			"火灾显示盘","探测回路","控制回路","主电源","备用电源","充电电路","声光警报回路",
			"火灾探测器","感烟火灾探测器","点型离子感烟火灾探测器","点型光电感烟火灾探测器","线型光束感烟火灾探测器","吸气式感烟火灾探测器",
			"感温火灾探测器","点型感温火灾探测器","线型感温火灾探测器","缆式线型火灾探测器","空气管式线型火灾探测器","线型光纤感温火灾探测器",
			"火焰探测器","点型红外火焰探测器","点型紫外火焰探测器","点型复合式红外紫外火焰探测器",
			"多传感复合探测器","感光火灾探测器","图像型火灾探测器","点型一氧化碳火灾探测器",
			"手动火灾报警按钮","消火栓按钮","紧急启动按钮","紧急停止按钮",
			"模块","输入模块","输出模块","输入/输出模块","中继模块","短路隔离器",
			"火灾警报装置","火灾声光警报器","火灾声警报器","火灾光警报器","气体释放警报器","警铃",
			"可燃气体报警控制器","可燃气体探测器","点型可燃气体探测器","线型可燃气体探测器",
			"电气火灾监控设备","电气火灾监控探测器","剩余电流式电气火灾监控探测器","测温式电气火灾监控探测器","故障电弧探测装置",
			"应急照明控制器","消防应急标志灯具","消防应急照明灯具","消防应急灯具专用应急电源","应急照明分配电装置",
			"防火门监控器","常闭防火门","常开防火门","防火门电动闭门器","防火门电磁释放器","防火门门磁开关",
			"消防设备电源监控器","消防设备电源电压信号传感器","消防设备电源电流信号传感器","消防设备电源电压/电流信号传感器",
			"气体灭火控制器","泡沫灭火系统","干粉灭火系统","防烟排烟系统","防火卷帘控制器","挡烟垂壁控制装置","消防应急广播","消防电话主机","消防设备应急电源","传输设备","家用火灾安全系统控制中心监控设备","消防水位监视器","消防电梯","消防电气控制装置",
			"消防栓泵","水喷雾泵","细水雾泵","稳压泵","喷淋泵","雨淋泵",
			"泡沫液泵","水流指示器","报警阀","压力开关","阀驱动装置","防火阀",
			"70度防火阀","280度防火阀","通风空调","管网电磁阀",
			"防烟排烟风机","排烟防火阀","常闭送风口","排烟口","消防水炮",
			"电动门","排烟机","送风机","电磁阀","照明配电","动力配电","空压机","阀门","配电箱"
	};
	final static String[][] state_names = {{"手动状态","自动状态","离线"},{"主电工作","备电工作","离线"},{"电源正常","电源故障","离线"},{"无报警","有报警","离线"},{"无启动","有启动","离线"},
			{"无反馈","有反馈","离线"},{"无监管","有监管","离线"},{"无故障","有故障","离线"},{"无屏蔽","有屏蔽","离线"},{"无气体喷洒","有气体喷洒","离线"},{"无应急","有应急","离线"}};
	final static long today_time = Timestamp.valueOf("2017-07-06 00:00:00").getTime();  //此处得到的是UTC时间的长整型，而字符串中为本地时间，这其中有一个转换的过程。
	
	final static long eventstart_time = Timestamp.valueOf("2017-07-20 00:00:00").getTime(); //以北京时间7月20日为基准
	
	
	final static int[] urgent_code = {2,3,4,5,6,7,8,20,21,22,23,24,25,26,27,28,29,30,40,43, 44, 45, 46, 89, 90, 109, 110};
	final static String[] urgent_event = {"首火警","火警","电气火灾报警","可燃气体低限报警","可燃气体高限报警","可燃气体超量程报警","电气火灾预警",
							"启动","自动启动","手动启动","现场急启","气体灭火开始延时","气体喷洒","反馈","喷洒反馈","反馈撤销","停止","现场急停",
							"应急","标志灯具改变方向","电梯迫降","卷帘半降","卷帘全降","常闭防火门打开","常开防火门关闭","常闭防火门恢复关闭状态","常开防火门恢复开门状态"};
	
	final static int[] common_code = {41,42,47,48,49,50,51,52,53,54,55,56,70,71,72,73,80,81,82,83,84,85,86,87,88,
			100,101,102,103,104,105,106,107,108,120,121,123,124,127,128,129};
	final static String[] common_event = {"月检", "年检",
			"呼叫","通话","消防设备电源失电","消防设备电源欠压","消防设备电源过压","消防设备电源过载","消防设备电源缺相","消防设备电源错相","消防水箱（池）水位低","消防电梯停用",
			"监管","监管解除","屏蔽","屏蔽解除",
			"故障","通讯故障","主电故障","备电故障","充电故障","回路故障","部件故障","线路故障","接地故障",
			"故障恢复","通讯故障恢复","主电故障恢复","备电故障恢复","充电故障恢复","回路故障恢复","部件故障恢复","线路故障恢复","接地故障恢复",
			"开机","关机","复位","自检","自检失败","手动状态","自动状态","确认/消音"};
	final static String[] system_type_names = {"火灾报警系统","消防联动控制器","消火栓系统","自动喷水灭火系统","气体灭火系统","水喷雾灭火系统（泵启动方式）","水喷雾灭火系统（压力容器启动方式）",	// 通用类型暂不考虑
			"泡沫灭火系统","干粉灭火系统","防烟排烟系统","防火门及卷帘系统","消防电梯","消防应急广播","消防应急照明和疏散指示系统","消防电源","消防电话"};
	final static int[] system_type_code = {1,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24};
}
